uhnp/src/Catalogs/ОбъектыПланирования/ОбъектыПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыПланирования</name>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСсылки</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/ОбъектыПланирования/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция получает ОбъектПланирования 
Функция НайтиОбъектПланирования(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Справочники.ОбъектыПланирования.ПустаяСсылка();
	КонецЕсли;
	
	ТипыОбъектовПланирования = Метаданные.ОпределяемыеТипы.ОбъектыПланирования.Тип.Типы();
	
	ТипДокумента = ТипЗнч(Ссылка);
	Если ТипыОбъектовПланирования.Найти(ТипДокумента) = неопределено Тогда
		Шаблон = НСтр("ru = 'На основании %1 не может быть создан объект планирования.
							|Тип не входит в определяемый тип ""ОбъектыПланирования""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Ссылка);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыПланирования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыПланирования КАК ОбъектыПланирования
	|ГДЕ
	|	ОбъектыПланирования.Объект = &Ссылка";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.ОбъектыПланирования.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

// Функция получает ОбъектПланирования и перезаполняет его по объекту
Функция ПолучитьОбъектПланирования(Ссылка, Объект = неопределено, ОбработчикОбновления = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Справочники.ОбъектыПланирования.ПустаяСсылка();
	КонецЕсли;
	
	ТипыОбъектовПланирования = Метаданные.ОпределяемыеТипы.ОбъектыПланирования.Тип.Типы();
	
	ТипДокумента = ТипЗнч(Ссылка);
	Если ТипыОбъектовПланирования.Найти(ТипДокумента) = неопределено Тогда
		Шаблон = НСтр("ru = 'На основании %1 не может быть создан объект планирования.
							|Тип не входит в определяемый тип ""ОбъектыПланирования""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Ссылка);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыПланирования.Ссылка КАК Ссылка,
	|	ОбъектыПланирования.ПометкаУдаления КАК ПометкаУдаления,
	|	ОбъектыПланирования.Наименование КАК Наименование,
	|	ОбъектыПланирования.Объект КАК Объект,
	|	ОбъектыПланирования.ТипСсылки КАК ТипСсылки
	|ИЗ
	|	Справочник.ОбъектыПланирования КАК ОбъектыПланирования
	|ГДЕ
	|	ОбъектыПланирования.Объект = &Ссылка";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ДанныеОбъектаПланирования = неопределено;
	Иначе
		ДанныеОбъектаПланирования = Новый Структура;
		Для Каждого Колонка Из Результат.Колонки Цикл
			ДанныеОбъектаПланирования.Вставить(Колонка.Имя);
		КонецЦикла;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеОбъектаПланирования, Выборка);
	КонецЕсли;
	
	Если Объект = неопределено Тогда
		//
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");
		ДанныеДокумента.Вставить("Ссылка", Ссылка);
		ДанныеДокумента.Вставить("Представление", Строка(Ссылка));
	Иначе
		ДанныеДокумента = Объект;
	КонецЕсли;
	
	// Проверить/заполнить объект планирования 
	ПроверитьЗаполнитьОбъектПланирования(ДанныеДокумента, ДанныеОбъектаПланирования, ОбработчикОбновления);
	
	Возврат ДанныеОбъектаПланирования.Ссылка;
		
КонецФункции

Процедура ОбъектыПланирования_ПриЗаписиОбработчик(Источник) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнитьОбъектПланирования(ДанныеДокумента, ДанныеОбъектаПланирования, ОбработчикОбновления = Ложь)
	
	НовыеПараметрыОбъектаПланирования = ПолучитьПараметрыОбъектаПланирования(ДанныеДокумента);
	
	Если ДанныеОбъектаПланирования = неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		СправочникОбъект = Справочники.ОбъектыПланирования.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СправочникОбъект, НовыеПараметрыОбъектаПланирования);
		Если ОбработчикОбновления Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		Иначе
			СправочникОбъект.Записать();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
		ДанныеОбъектаПланирования = НовыеПараметрыОбъектаПланирования;
		ДанныеОбъектаПланирования.Вставить("Ссылка", СправочникОбъект.Ссылка);
		
		Возврат;
		
	КонецЕсли;
	
	// Требуется ли производить обновление
	Для Каждого КлючЗначение Из НовыеПараметрыОбъектаПланирования Цикл
		
		РеквизитОбъекта = ДанныеОбъектаПланирования[КлючЗначение.Ключ];
		ПараметрОбъекта = НовыеПараметрыОбъектаПланирования[КлючЗначение.Ключ];
		
		ТребуетсяПерезаполнение = РеквизитОбъекта <> ПараметрОбъекта;
		Если ТребуетсяПерезаполнение Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяПерезаполнение Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		СправочникОбъект = ДанныеОбъектаПланирования.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СправочникОбъект, НовыеПараметрыОбъектаПланирования);
		Если ОбработчикОбновления Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		Иначе
			СправочникОбъект.Записать();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаполнитьЗначенияСвойств(ДанныеОбъектаПланирования, НовыеПараметрыОбъектаПланирования);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыОбъектаПланирования(Объект)
	
	Ссылка = Объект.Ссылка;
	
	ПараметрыОбъектаПланирования = Новый Структура;
	ПараметрыОбъектаПланирования.Вставить("Объект", Ссылка);
	ПараметрыОбъектаПланирования.Вставить("ТипСсылки", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка)));
	
	
	Если ТипЗнч(Объект) = Тип("Структура") И Объект.Свойство("Представление") Тогда
		Наименование = Объект.Представление;
	Иначе
		Наименование = ?(Строка(Объект)="",НСтр("ru = '<Пустой>'"),Строка(Объект));
	КонецЕсли;
	ПараметрыОбъектаПланирования.Вставить("Наименование", Наименование);
	ПараметрыОбъектаПланирования.Вставить("ПометкаУдаления", Объект.ПометкаУдаления);
	
	Возврат ПараметрыОбъектаПланирования;
	
КонецФункции

#КонецОбласти
